[
	"Puppies love games such as hide and seek! Hide, then call your pup's name so she can try to find you.",
	"Dogs can learn more than 1000 words.",
	"Big happy \"helicopter\" tail wagging is one sign of a really nice dog",
	"Upright, stiff, rapid tail movement is not wagging or \"friendly\" but indicates a dog who's rather excited and focused.",
	"Puppies grow to half their body weight in the first four to five months.",
	"Puppies then take a year or more to gain the other half of their body weight.",
	"Puppies can sleep 18 to 20 hours a day during their rapid body growth phase.",
	"Dogs sometimes appear to smile -- much like humans -- with open mouth grinning. This may indicate a relaxed, submissive state.",
	"Tired puppies get cranky just like little kids. If you have a fussy puppy, try nap time.",
	"The fastest breed, the Greyhound, can run up to 44 miles per hour.",
	"The Labrador Retriever has been on the AKC's top 10 most popular breeds list for 25 consecutive years—longer than any other breed.",
	"A dog's nose print is unique, much like a person's fingerprint.",
	"Forty-five percent of U.S. dogs sleep in their owner's bed.",
	"All dogs dream, but puppies and senior dogs dream more frequently than adult dogs.",
	"Seventy percent of people sign their dog's name on their holiday cards.",
	"A dog's sense of smell is legendary, but did you know that his nose has as many as 300 million receptors? In comparison, a human nose has about 5 million.",
	"Rin Tin Tin, the famous German Shepherd, was nominated for an Academy Award.",
	"The shape of a dog's face suggests its longevity: A long face means a longer life.",
	"Dog eyes have a part called the tapetum lucidum, allowing night vision.",
	"The name Collie means \"black.\" (Collies once tended black-faced sheep.)",
	"Yawning is contagious—even for dogs. Research shows that the sound of a human yawn can trigger one from your dog. And it's four times as likely to happen when it's the yawn of a person he knows.",
	"The Dandie Dinmont Terrier is the only breed named for a fictional person—a character in the novel Guy Mannering, by Sir Walter Scott.",
	"Dogs curl up in a ball when sleeping to protect their organs—a hold over from their days in the wild, when they were vulnerable to predator attacks.",
	"The Basenji is not technically \"barkless,\" as many people think. They can yodel.",
	"The Australian Shepherd is not actually from Australia—they are an American breed.",
	"The Labrador Retriever is originally from Newfoundland.",
	"Human blood pressure goes down when petting a dog. And so does the dog's.",
	"There are over 75 million pet dogs in the U.S.—more than in any other country.",
	"A person who hunts with a Beagle is known as a \"Beagler.\"",
	"Dogs are not colorblind. They also see blue and yellow.",
	"All puppies are born deaf.",
	"Dalmatians are born completely white, and develop their spots as they get older.",
	"Dogs have about 1,700 taste buds. (We humans have between 2,000–10,000.)",
	"When dogs kick backward after they go to the bathroom it's not to cover it up, but to mark their territory, using the scent glands in their feet.",
	"A recent study shows that dogs are among a small group of animals who show voluntary unselfish kindness towards others without any reward. This is one fact dog lovers have known all along.",
	"There's a reason your tot and your pup get along so well: they speak the same language. Or at least, they likely understand roughly the same number of words and gestures — 250!",
	"This may be hard to believe since dogs are such messy drinkers, but just like cats, our canine friends bend the tip of their tongue and raise liquid in a column up to their mouths.",
	"Your dog does have a sense of time — and misses you when you're gone.",
	"Your dog's whiskers help him \"see\" in the dark.",
	"Dogs only have sweat glands in their paws.",
	"On average, a dog's mouth exerts 320 pounds of pressure.",
	"Your one year-old pup is as physically mature as a 15-year-old human.",
	"Your dog's sense of smell is 1,000 to 10 million times better than yours.",
	"Dogs can hear 4 times as far as humans.",
	"Your dog can smell your feelings.",
	"Corgi is Welsh for \"dwarf dog.\"",
	"The Newfoundland breed has a water resistant coat and webbed feet. This dog was originally bred to help haul nets for fishermen and rescuing people at risk of drowning.",
	"Three dogs (from First Class cabins!) survived the sinking of the Titanic – two Pomeranians and one Pekingese.",
	"It's rumored that, at the end of the Beatles song, \"A Day in the Life,\" Paul McCartney recorded an ultrasonic whistle, audible only to dogs, just for his Shetland sheepdog.",
	"Puppies have 28 teeth and normal adult dogs have 42.",
	"Dogs chase their tails for a variety of reasons: curiosity, exercise, anxiety, predatory instinct or, they might have fleas!",
	"Dogs and humans have the same type of slow wave sleep (SWS) and rapid eye movement (REM) and during this REM stage dogs can dream. The twitching and paw movements that occur during their sleep are signs that your pet is dreaming",
	"Dogs' eyes contain a special membrane, called the tapetum lucidum, which allows them to see in the dark.",
	"A large breed dog's resting heart beats between 60 and 100 times per minute, and a small dog breed's heart beats between 100-140. Comparatively, a resting human heart beats 60-100 times per minute.",
	"72% of dog owners believe their dog can detect when stormy weather is on the way.",
	"A dog's normal temperature is between 101 and 102.5 degrees Fahrenheit.",
	"Dogs have three eyelids, an upper lid, a lower lid and the third lid, called a nictitating membrane or \"haw,\" which helps keep the eye moist and protected.",
	"62% of U.S. households own a pet, which equates to 72.9 million homes.",
	"Dogs' noses secrete a thin layer of mucous that helps them absorb scent. They then lick their noses to sample the scent through their mouth.",
	"Dogs have about 1,700 taste buds. Humans have approximately 9,000 and cats have around 473.",
	"A Dog's sense of smell is 10,000 – 100,000 times more acute as that of humans.",
	"It's a myth that dogs only see in black and white. In fact, it's believed that dogs see primarily in blue, greenish-yellow, yellow and various shades of gray.",
	"Dogs hear best at 8,000 Hz, while humans hear best at around 2,000 Hz.",
	"Dogs' ears are extremely expressive. It's no wonder! There are more than a dozen separate muscles that control a dog's ear movements.",
	"While the Chow Chow dogs are well known for their distinctive blue-black tongues, they're actually born with pink tongues. They turn blue-black at 8-10 weeks of age.",
	"When dogs kick after going to the bathroom, they are using the scent glands on their paws to further mark their territory.",
	"In addition to sweating through their paw pads, dogs pant to cool themselves off. A panting dog can take 300-400 breaths (compared to his regular 30-40) with very little effort.",
	"More than 1 in 3 families in the United States owns a dog.",
	"Spaying or neutering your dog can help prevent certain types of cancer.",
	"If never spayed or neutered, a pair of dogs can produce 66,000 puppies in 6 years.",
	"The average dog can run about 19 miles per hour at full speed.",
	"Dogs are mentioned 14 times in the Bible.",
	"Dogs don't feel guilt.",
	"Dog urine can corrode metal.",
	"Dogs can smell disease.",
	"Service dogs pee and poop on command and know when they're on or off duty.",
	"Given their druthers, dogs will poop facing the North-South magnetic axis. Scientists have no theories yet as to why.",
	"Two stray dogs in 1860's San Francisco were sanctioned to roam free by the local constabulary. Bummer and Lazarus were local icons, heralded in cartoons and newspaper articles for their daring adventures as rat-catchers and petty thieves.",
	"Boy Scouts and Girl Scouts can earn badges for dog care and pet care.",
	"Max, the world's oldest dog, passed away at the ripe old age of 29 years and 282 days old in 2013. He was a beagle and terrier mix.",
	"George Washington had a favorite fox hound named Sweetlips and a dalmatian coach dog named Madame Moose.",
	"Dogs have 18 muscles controlling their ears, cats have 32, and humans have only 6.",
	"Did you know tripping over your dog is the second most likely way to get injured around hounds? Bites are the most common.",
	"Chihuahuas are born with an incomplete skull just like a human baby. The soft spot is known as a molera in dogs and fontanelle in humans.",
	"Male dogs lift a leg to pee to make themselves appear larger to other dogs. ",
	"Dogs and wolves split from a common ancestor around 34,000 years ago.",
	"Wolves howl by themselves to get the attention of their pack, or the pack of wolves will howl to get the attention of another pack.",
	"In order to socialize them early, it helps for Ambassador wolves to have puppy playmates.",
	"When the WCC raises pups without their mothers, they sometimes enlist dogs be parental figures, to show the wolf pups how to properly interact with the hoomans.",
	"Dogs are as smart as a two-year-old baby.",
	"Dogs only mate twice a year.",
	"Tail wagging has its own language.",
	"Dogs have a \"sixth sense.\"",
	"Your dog's feet might smell like corn.",
	"\"Dog breath\" is actually unhealthy.",
	"It's not abnormal for dogs to eat feces.",
	"A dog's unique smell is secreted in its glands.",
	"The idea that a dog's saliva has healing powers has been around at least since the ancient Greeks and Romans, whose physicians believed it to be an antidote for poisoning.",
	"The phrase \"Beware of Dog\" is so old that its Latin equivalent — \"cave canem\" — has been found on signs in Roman ruins.",
	"Putting collars on dogs is an ancient practice, but dog licenses are much more recent."
]